config.el
(customize-set-variable 'scroll-bar-mode nil)
(customize-set-variable 'horizontal-scroll-bar-mode nil)
(customize-set-variable 'blink-cursor-mode nil)
(customize-set-variable 'tool-bar-mode nil)

(defalias 'yes-or-no-p 'y-or-n-p)

(setq-default inhibit-startup-screen t
              initial-scratch-message ""
	      	  visible-bell nil                               ; No shaking
	          confirm-nonexistent-file-or-buffer nil         ; Remove confirm dialog on new buffers
	          show-paren-delay 0                             ; No delay when showing matching parenthesis
	          confirm-kill-emacs 'y-or-n-p                   ; Confirm exiting Emacs
	          display-time-default-load-average nil          ; Don't display load average
	          indent-tabs-mode nil                           ; No tabs for indentation
	          select-enable-clipboard t                      ; Unite Emacs & system clipboard
	          window-combination-resize t                    ; Create new windows proportionally
	          use-package-always-ensure t)                    ; Install packages if not found on the system

(setq scroll-margin 1
      scroll-conservatively 0
      scroll-up-aggressively 0.01
      scroll-down-aggressively 0.01)

(setq-default scroll-up-aggressively 0.01
              scroll-down-aggressively 0.01)

;; disable CJK coding/encoding (Chinese/Japanese/Korean characters)
(setq utf-translate-cjk-mode nil)

(prefer-coding-system 'utf-8)
(setq default-file-name-coding-system 'utf-8)
(set-default-coding-systems 'utf-8)
(set-terminal-coding-system 'utf-8)
(set-keyboard-coding-system 'utf-8)
(set-language-environment 'utf-8)
(set-language-environment 'utf-8)
(setq locale-coding-system 'utf-8)

(if (boundp buffer-file-coding-system)
    (setq buffer-file-coding-system 'utf-8)
  (setq default-buffer-file-coding-system 'utf-8))

;; Treat clipboard input as UTF-8 string first; compound text next, etc.
(setq x-select-request-type '(UTF8_STRING COMPOUND_TEXT TEXT STRING))

(global-set-key (kbd "C-+") 'text-scale-increase)        ; Bigger
(global-set-key (kbd "C--") 'text-scale-decrease)        ; Smaller
(global-set-key (kbd "M-n") 'next-multiframe-window)     ; Cycle through frames
(global-set-key (kbd "M-p") 'previous-multiframe-window) ; Cycle through frames

;(setq custom-file (expand-file-name ".custom.el" user-emacs-directory))
;(when (file-exists-p custom-file)
;  (load custom-file))

(use-package monokai-theme
  :init
  (load-theme 'monokai t))

(use-package exec-path-from-shell
  :if (memq window-system '(mac ns x))
  :config
  (setq exec-path-from-shell-variables '("PATH" "GOPATH")
        exec-path-from-shell-check-startup-files nil)
  (exec-path-from-shell-initialize))

(when (eq system-type 'darwin)
  (setq-default
   exec-path (append exec-path '("/usr/local/bin"))  ; Add Homebrew path
   mac-command-modifier 'meta                        ; Map Meta to Cmd
   mac-option-modifier nil                           ; Don't use Option key 
   mac-right-option-modifier nil                     ; Disable the right Alt key
   ns-pop-up-frames nil                              ; Visit files in same frame
   dired-use-ls-dired nil))                          ; macOS command ls doesn't support --dired option

(setq backup-by-copying t
      backup-directory-alist '(("." . "~/.emacs.d/backup"))
      delete-old-versions t
      kept-new-versions 3
      kept-old-versions 2
      version-control t
      create-lockfiles nil
      vc-follow-symlinks t)

(use-package dockerfile-mode
  :mode "Dockerfile\\'" 
  :mode "Dockerfile.test\\'")

(use-package sgml-mode
  :mode "\\.html\\'"
  :config (setq-default sgml-basic-offset 2))

(use-package markdown-mode
  :mode "INSTALL\\'"
  :mode "CONTRIBUTORS\\'"
  :mode "LICENSE\\'"
  :mode "README\\'"
  :mode "\\.markdown\\'"
  :mode "\\.md\\'"
  :config
  (setq-default
   markdown-asymmetric-header t
   markdown-split-window-direction 'right))

(use-package yaml-mode
  :mode "\\.yml\\'"  
  :mode "\\.yaml\\'")

(use-package csv-mode
  :mode "\\.[Cc][Ss][Vv]\\'"
  :init (setq csv-separators '("," ";" "|" " "))
  :config (use-package csv-nav))

(use-package magit
  :config
  (setq-default
   magit-refs-show-commit-count 'all
   magit-section-show-child-count t))

(use-package go-mode
  :mode "\\.go\\'"
  :mode "\\.toml\\'"
  :init
  (add-hook 'before-save-hook #'gofmt-before-save))

(use-package go-eldoc
  :init
  (add-hook 'go-mode-hook 'go-eldoc-setup))

(use-package go-add-tags)

(use-package enh-ruby-mode
  :mode "\\.rb\\'"
  :mode "\\.rake\\'"
  :mode "\\.ru\\'"
  :mode "Gemfile\\'"
  :mode "Rakefile\\'"
  :mode "Capfile\\'" 
  :mode "\\.gemspec\\'"
  :config
  (setq enh-ruby-add-encoding-comment-on-save nil
        enh-ruby-deep-indent-paren nil
        enh-ruby-hanging-brace-indent-level 2
        enh-ruby-use-encoding-map nil
        rspec-autosave-buffer t
        rspec-compilation-buffer-name "*rspec-compilation*"
        rspec-use-opts-file-when-available nil
        rspec-use-rake-flag nil
        ruby-deep-arglist nil
        ruby-deep-indent-paren nil
        ruby-end-insert-newline nil
        ruby-insert-encoding-magic-comment nil
        ruby-indent-level 2
        ruby-indent-tabs-mode nil)
)

(use-package yari
  :after enh-ruby-mode
  :init
  (add-hook 'enh-ruby-mode-hook (lambda () (local-set-key [f1] 'yari))))

(use-package inf-ruby
  :after enh-ruby-mode
  :init
  (add-hook 'enh-ruby-mode-hook 'inf-ruby-minor-mode))

(use-package rspec-mode
  :after enh-ruby-mode)

(use-package rvm
  :after enh-ruby-mode
  :config
  (rvm-use-default))

(use-package feature-mode
  :commands feature-mode
  :config
  (setq feature-default-language "en"))

(use-package which-key
 :init
 (add-hook 'after-init-hook 'which-key-mode)
 :config
 (which-key-mode)
 (setq which-key-idle-delay 0.25))

(use-package ace-window
  :config
  :bind* ("M-o" . ace-window))

(global-set-key (kbd "C-x C-b") 'ibuffer)

(setq epg-gpg-program "gpg2")
(setf epa-pinentry-mode 'loopback)
(setq epa-file-inhibit-auto-save t)

(use-package pinentry
  :config
  (pinentry-start))

(dolist (mode
