config.org
** Misc

#+BEGIN_SRC emacs-lisp
(dolist (mode
  '(global-prettify-symbols-mode        ; Greek letters should look greek
    global-auto-revert-mode             ; Reload files when change, please
    show-paren-mode                     ; Highlight matching parentheses
    cua-mode                            ; Global Cmd-c, Cmd-x to copy & paste
    global-display-line-numbers-mode    ; Native line numbers
    ))
  (funcall mode 1))
#+END_SRC




** Tramp mode

Use tramp to shell into other machines.

#+BEGIN_SRC emacs-lisp
(use-package tramp
  :config
  (tramp-set-completion-function "ssh" '((tramp-parse-sconfig "/etc/ssh_config") (tramp-parse-sconfig "~/.ssh/config"))))
#+END_SRC




** Smart parens

Use smart parens when writing parenthesis to not let any parethesis unmatched.

#+BEGIN_SRC emacs-lisp
(use-package smartparens
  :ensure t
  :init
    (add-hook 'enh-ruby-mode-hook 'smartparens-strict-mode))
#+END_SRC




** Org

Adding org files for agenda

#+BEGIN_SRC emacs-lisp
(setq org-directory "/keybase/private/spavi/org/")
(require 'find-lisp)
(setq org-agenda-files
      (find-lisp-find-files org-directory "\.org.gpg$"))
(setq org-default-notes-file "/keybase/private/spavi/org/refile.org.gpg")
#+END_SRC

The thick of it

#+BEGIN_SRC emacs-lisp
  (use-package org
    :init
    (setq org-support-shift-select t
          org-return-follows-link t
          org-hide-emphasis-markers t
          org-outline-path-complete-in-steps nil
          org-src-fontify-natively t
          org-src-tab-acts-natively t
          org-confirm-babel-evaluate nil
          org-log-done t
          org-refile-targets '((nil :maxlevel . 9) (org-agenda-files :maxlevel . 9))
          org-refile-use-outline-path t
          org-outline-path-complete-in-steps nil
          org-completion-use-ido t
          ido-everywhere t
          ido-max-directory-size 100000
          ido-default-file-method 'selected-window
          ido-default-buffer-method 'selected-window
          org-indirect-buffer-display 'current-window
          org-fast-tag-selection-include-todo t
          org-use-fast-todo-selection t
          org-startup-indented t)
    (add-to-list 'auto-mode-alist '("\\.txt\\'" . org-mode))
    (add-to-list 'auto-mode-alist '(".*/[0-9]*$" . org-mode))
    (add-hook 'org-mode-hook 'auto-fill-mode)
    (add-hook 'org-journal-mode-hook 'auto-fill-mode)
    :bind (("C-c l" . org-store-link)
           ("C-c n" . org-capture)
           ("C-c a" . org-agenda))
    :config
    (font-lock-add-keywords
     'org-mode `(("^\\*+ \\(TODO\\) "
                  (1 (progn (compose-region (match-beginning 1) (match-end 1) "⚑") nil)))
                 ("^\\*+ \\(PROGRESSING\\) "
                  (1 (progn (compose-region (match-beginning 1) (match-end 1) "⚐") nil)))
                 ("^\\*+ \\(CANCELED\\) "
                  (1 (progn (compose-region (match-beginning 1) (match-end 1) "✘") nil)))
                 ("^\\*+ \\(DONE\\) "
                  (1 (progn (compose-region (match-beginning 1) (match-end 1) "✔") nil)))))

    (setq org-tag-alist '((:startgroup) ("@w0rk" . ?w) ("@home" . ?h) (:endgroup))
          org-todo-keywords '((sequence "TODO(t)" "PROGRESSING(p)" "|" "DONE(d)")
                              (sequence "INACTIVE(i@/!)" "|" "CANCELLED(c@/!)"))
          org-todo-keyword-faces
          '(("TODO" :foreground "red" :weight bold)
            ("PROGRESSING" :foreground "blue" :weight bold)
            ("DONE" :foreground "forest green" :weight bold)
            ("INACTIVE" :foreground "magenta" :weight bold)
            ("CANCELLED" :foreground "brown" :weight bold)))
    (setq org-agenda-custom-commands
          '(("w" "Work" tags-todo "@w0rk")
            ("h" "Home" tags-todo "@home")))

    (define-key org-mode-map [remap org-return] (lambda () (interactive)
                                                  (if (org-in-src-block-p)
                                                      (org-return) (org-return-indent)))))
#+END_SRC

Org journaling

#+BEGIN_SRC emacs-lisp
(use-package org-journal
  :config
  (setq org-journal-date-format "%A, %d.%m.%Y"
        org-journal-file-format "%Y%m%d"
        org-journal-dir "/keybase/private/spavi/org/diary/"))
#+END_SRC

Org template custom configurations

#+BEGIN_SRC emacs-lisp
(defvar org-capture-templates
  '(
    ("t" "To-do task." 
     entry 
     (file+headline org-default-notes-file "Tasks")
     "* TODO %?\n%u\n%a\n" :clock-in t :clock-resume t)
    ("w" "Work task." 
     entry 
     (file+headline org-default-notes-file "Work Task")
     "* TODO %?\n%u\n%a\n" 
     :clock-in t 
     :clock-resume t)
    ("l" "Link: Something interesting?"
     entry
     (file+headline org-default-notes-file "Links")
     (file "~/.emacs.d/org-templates/links.orgcaptmpl"))
    ("i" "Idea came up." 
     entry 
     (file org-default-notes-file)
     "* %? :IDEA: \n%u" :clock-in t :clock-resume t)))
#+END_SRC

Meeting note taking (source: [[https://github.com/howardabrams/dot-files/][Howard Abrams' Github]])

#+BEGIN_SRC emacs-lisp
(defun meeting-notes ()
  "Call this after creating an org-mode heading for where the notes for the meeting
should be. After calling this function, call 'meeting-done' to reset the environment."
  (interactive)
  (outline-mark-subtree)                              ;; Select org-mode section
  (narrow-to-region (region-beginning) (region-end))  ;; Only show that region
  (deactivate-mark)
  (delete-other-windows)                              ;; Get rid of other windows
  (text-scale-set 2)                                  ;; Text is now readable by others
  (fringe-mode 0)
  (message "When finished taking your notes, run meeting-done."))
#+END_SRC

#+BEGIN_SRC emacs-lisp
(defun meeting-done ()
  "Attempt to 'undo' the effects of taking meeting notes."
  (interactive)
  (widen)                                       ;; Opposite of narrow-to-region
  (text-scale-set 0)                            ;; Reset the font size increase
  (fringe-mode 1)
  (winner-undo))                                ;; Put the windows back in place
#+END_SRC

Bullets!

#+BEGIN_SRC emacs-lisp
(use-package org-bullets
  :after org
  :hook
  (org-mode . (lambda () (org-bullets-mode 1))))
#+END_SRC

Calendar modifications (Finnish calendar, etc)

#+BEGIN_SRC emacs-lisp
(use-package suomalainen-kalenteri
  :after org
  :config
  (setq calendar-date-style 'european
        calendar-latitude 60.1     ; Roughly Helsinki
        calendar-longitude 24.9    ; Roughly Helsinki
        calendar-week-start-day 1  ; Weeks start on Monday
        calendar-today-visible-hook 'calendar-mark-today
        calendar-holidays suomalainen-kalenteri
        org-agenda-include-diary t))
#+END_SRC

I want my <s TAB expansions back!.

#+BEGIN_SRC emacs-lisp
(add-to-list 'org-modules 'org-tempo)
#+END_SRC

Some org-agenda and habits specific configs.

#+BEGIN_SRC emacs-lisp
(add-to-list 'org-modules 'org-habit)
(setq org-agenda-use-tag-inheritance nil
      org-agenda-ignore-drawer-properties '(effort appt category)
      org-agenda-dim-blocked-tasks nil
      org-agenda-tags-column -55
      org-log-into-drawer t
      org-habit-show-habits-only-for-today nil
      org-habit-graph-column 60
      org-habit-show-all-today t
      org-habit-show-following-days 10
      org-habit-preceding-days 10
      org-habit-show-habits t)
#+END_SRC



** Projectile

Use Projectile for jumping around code, etc.

#+BEGIN_SRC emacs-lisp
(use-package projectile
  :defer 1
  :init
  (setq-default
   projectile-cache-file (expand-file-name ".projectile-cache" user-emacs-directory)
   projectile-keymap-prefix (kbd "C-c C-p")
   projectile-known-projects-file (expand-file-name
                                   ".projectile-bookmarks" user-emacs-directory))
  :config
  (projectile-global-mode 1)
  (setq-default
   projectile-indexing-method 'alien
   projectile-globally-ignored-modes '("org-mode" "org-agenda-mode")
   projectile-globally-ignored-file-suffixes '(".gpg")
   projectile-completion-system 'ido
   projectile-enable-caching t
   projectile-mode-line '(:eval (projectile-project-name)))
   (add-hook 'org-agenda-mode-hook (lambda () (projectile-mode -1)))
   (add-hook 'org-mode-hook (lambda () (projectile-mode -1))))
#+END_SRC


** Highlight

#+BEGIN_SRC emacs-lisp
(use-package highlight)
#+END_SRC




