config.org
** Treemacs

#+BEGIN_SRC emacs-lisp
(use-package treemacs
  :config
  (setq treemacs-follow-after-init t
        treemacs-width 35
        treemacs-indentation 1
        treemacs-recenter-after-file-follow nil
        treemacs-silent-refresh t
        treemacs-silent-filewatch t
        treemacs-change-root-without-asking t
        treemacs-sorting 'alphabetic-desc
        treemacs-show-hidden-files t
        treemacs-never-persist nil
        treemacs-is-never-other-window f
        treemacs-indentation-string (propertize " ǀ " 'face 'font-lock-comment-face)
        treemacs-follow-mode t
        treemacs-filewatch-mode t
        treemacs-fringe-indicator-mode t)
  :bind
  (([f8] . treemacs)
   ("C-c f" . treemacs-select-window)))

(use-package treemacs-projectile
  :after treemacs projectile
  :bind 
  (("C-c o p" . treemacs-projectile)))
#+END_SRC


** Yafolding

#+BEGIN_SRC emacs-lisp
(use-package yafolding
  :bind 
  (("M-RET" . yafolding-toggle-element)
  ("M-m" . yafolding-toggle-all))
  :init
  (add-hook 'enh-ruby-mode-hook 'yafolding-mode))
  ;;(define-key yafolding-mode-map (kbd "M-m") 'yafolding-toggle-all)  
  ;;(define-key yafolding-mode-map (kbd "C-RET") 'yafolding-toggle-element)
#+END_SRC
  
